## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.inferno will be updated in-place
  ~ resource "helm_release" "inferno" {
        id                         = "dev-inferno"
      ~ metadata                   = [
          - {
              - app_version    = "1.16.0"
              - chart          = "inferno-helmd"
              - first_deployed = 1743653960
              - last_deployed  = 1750157234
              - name           = "dev-inferno"
              - namespace      = "dev-inferno"
              - revision       = 4
              - values         = jsonencode(
                    {
                      - controller = {
                          - enabled              = false
                          - ingressClass         = "nginx"
                          - ingressClassResource = {
                              - default = false
                              - enabled = true
                              - name    = "nginx"
                            }
                          - service              = {
                              - annotations = {
                                  - "service.beta.kubernetes.io/aws-load-balancer-type" = "nlb"
                                }
                            }
                        }
                      - inferno    = {
                          - externalValidatorUrl = null
                          - imageUrl             = "ghcr.io/hl7au/au-fhir-inferno:7e63c87ab50227d5b122dfdd59a3d2b8e62a9f2d-dev"
                          - terminologyServer    = "https://tx.dev.hl7.org.au/fhir"
                          - usesWrapper          = true
                          - validatorImageUri    = "ghcr.io/beda-software/validator-wrapper:latest"
                        }
                      - ingress    = {
                          - hostnames = [
                              - "dev.inferno.sparked-fhir.com",
                              - "inferno.dev.hl7.org.au",
                            ]
                        }
                      - nginx      = {
                          - example          = 12345
                          - platformImageUri = "ghcr.io/hl7au/au-fhir-inferno:7e63c87ab50227d5b122dfdd59a3d2b8e62a9f2d-nginx-dev"
                        }
                      - postgresql = {
                          - containerPorts = {
                              - postgresql = 5432
                            }
                          - enabled        = false
                          - externaldbhost = "(sensitive value)"
                          - global         = {
                              - postgresql = {
                                  - auth = {
                                      - database = "inferno"
                                      - password = "(sensitive value)"
                                      - username = "(sensitive value)"
                                    }
                                }
                            }
                        }
                    }
                )
              - version        = "0.2.0"
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
        name                       = "dev-inferno"
        # (26 unchanged attributes hidden)

      - set {
          - name  = "inferno.imageUrl" -> null
          - value = "ghcr.io/hl7au/au-fhir-inferno:7e63c87ab50227d5b122dfdd59a3d2b8e62a9f2d-dev" -> null
            # (1 unchanged attribute hidden)
        }
      - set {
          - name  = "nginx.platformImageUri" -> null
          - value = "ghcr.io/hl7au/au-fhir-inferno:7e63c87ab50227d5b122dfdd59a3d2b8e62a9f2d-nginx-dev" -> null
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "inferno.imageUrl"
          + value = "ghcr.io/hl7au/au-fhir-inferno:6a4c3eda83198640a2311e87a774c858f1488dda-dev"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "nginx.platformImageUri"
          + value = "ghcr.io/hl7au/au-fhir-inferno:6a4c3eda83198640a2311e87a774c858f1488dda-nginx-dev"
            # (1 unchanged attribute hidden)
        }

      - set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + set_sensitive {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

        # (5 unchanged blocks hidden)
    }

  # module.rds.module.db_instance.aws_db_instance.this[0] will be updated in-place
  ~ resource "aws_db_instance" "this" {
      ~ final_snapshot_identifier             = "final-dev-inferno-postgresql-2e346ee4" -> (known after apply)
        id                                    = "db-WNYX62I2KZJ3LN5AKYRLIMAOHQ"
        tags                                  = {
            "GithubRepo" = "https://github.com/hl7au/au-fhir-inferno"
            "Name"       = "dev-inferno"
        }
        # (71 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.rds.module.db_instance.random_id.snapshot_identifier[0] must be replaced
-/+ resource "random_id" "snapshot_identifier" {
      ~ b64_std     = "LjRu5A==" -> (known after apply)
      ~ b64_url     = "LjRu5A" -> (known after apply)
      ~ dec         = "775188196" -> (known after apply)
      ~ hex         = "2e346ee4" -> (known after apply)
      ~ id          = "LjRu5A" -> (known after apply)
      ~ keepers     = { # forces replacement
          - "snapshot_identifier" = null
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```
</details>